/*
 * Напиши скрипт підрахунку суми покупки зі знижкою в залежності від витраченої 
 * суми за весь час (партнерська програма).
 *
 * - Загальна сума витрачених коштів зберігається в змінній totalSpent
 * - Сума поточного платежа зберігається в змінній payment
 * - Знижка зберігається в змінній discount
* - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
 * - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
 * - Якщо витрачено менше 100) - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»
 */
    // const totalSpent = 2000;
    // let payment = 500;
    // let discount = 0;

    // if(100 < totalSpent && totalSpent < 1000) {
    //     discount = payment * 2 / 100;
    //     alert(`Бронзовий партнер, знижка 2%. До сплати = ${discount}`);
    // } else if (1000 < totalSpent && totalSpent < 5000) {
    //     discount = payment * 5 / 100;
    //     alert(`Бронзовий партнер, знижка 5%. До сплати = ${discount}`);
    // } else if (totalSpent > 5000) {
    //     discount = payment * 10 / 100;
    //     alert(`Бронзовий партнер, знижка 10%. До сплати = ${discount}`)
    // } else if (totalSpent < 100); {
    //     alert(`Не партнер, знижка 0%. До сплати = ${discount}`)
    // }

  // 'Бронзовий партнер, знижка 2%'
    // 'Срібний партнер, знижка 5%'
    // 'Золотий партнер, знижка 10%'
    // 'У вас ще немає партнерської знижки'

    // if ("0") {
    //     console.log( 'Привіт' );
    //    }
    

const answer = prompt('Яка “офіційна” назва JavaScript?');
    if (answer === 'ECMAScript') {
        alert('правильно');
    } else {
        alert('Ви не знаєте? ECMAScript');
    }





  